tutorials/verification/innerSpherePartTransp/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

domainSize  dSN;
domainSizeM  -dSN;

vertices
(
    ($domainSizeM $domainSizeM $domainSizeM)
    ($domainSize $domainSizeM  $domainSizeM)
    ($domainSize  $domainSize  $domainSizeM)
    ($domainSizeM  $domainSize $domainSizeM)
    ($domainSizeM $domainSizeM $domainSize)
    ($domainSize $domainSizeM $domainSize)
    ($domainSize  $domainSize $domainSize)
    ($domainSizeM  $domainSize $domainSize)
);

blocks
(
   // hex (0 1 2 3 4 5 6 7) (1 20 50) simpleGrading (1 1 1)
   // hex (0 1 2 3 4 5 6 7) (1 80 200) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7) (80 80 80) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (nDisc nDisc nDisc) simpleGrading (1 1 1)
);

boundary
(	
	// -- sides of the geometry
    infinity
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
