tutorials/verification/innerSpherePartTransp/baseCase/0.org/CO
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform yCOSet;

boundaryField
{
    infinity
    {
        type            fixedValue;
        value           uniform yCOSet;
    }
    sphere
    {
        type            fixedValue;
        value           uniform yCOSet;
    }
}

// ************************************************************************* //
